[
  {
    "id": "IPC-1",
    "act_name": "Indian Penal Code",
    "act_year": 1860,
    "act_short_name": "IPC",
    "section_number": "1",
    "section_title": "Title and extent of operation of the Code",
    "section_text": "This Act shall be called the Indian Penal Code, and shall take effect throughout India except in the territories which, immediately before the 1st day of November, 1956, were comprised in Part B States.",
    "chapter": "INTRODUCTION",
    "chapter_number": 1,
    "keywords": [
      "code",
      "indian",
      "penal",
      "1956",
      "title",
      "extent",
      "operation",
      "called",
      "take",
      "effect"
    ],
    "category": "Criminal",
    "searchable_text": "1 title and extent of operation of the code this act shall be called the indian penal code, and shall take effect throughout india except in the territories which, immediately before the 1st day of november, 1956, were comprised in part b states. indian penal code ipc"
  },
  {
    "id": "IPC-2",
    "act_name": "Indian Penal Code",
    "act_year": 1860,
    "act_short_name": "IPC",
    "section_number": "2",
    "section_title": "Punishment of offences committed within India",
    "section_text": "Every person shall be liable to punishment under this Code and not otherwise for every act or omission contrary to the provisions thereof, of which he shall be guilty within India.",
    "chapter": "INTRODUCTION",
    "chapter_number": 1,
    "keywords": [
      "punishment",
      "within",
      "india",
      "every",
      "code",
      "offences",
      "committed",
      "person",
      "liable",
      "otherwise"
    ],
    "category": "Criminal",
    "searchable_text": "2 punishment of offences committed within india every person shall be liable to punishment under this code and not otherwise for every act or omission contrary to the provisions thereof, of which he shall be guilty within india. indian penal code ipc"
  },
  {
    "id": "IPC-3",
    "act_name": "Indian Penal Code",
    "act_year": 1860,
    "act_short_name": "IPC",
    "section_number": "3",
    "section_title": "Punishment of offences committed beyond, but which by law may be tried within, India",
    "section_text": "Any person liable, by any Indian law, to be tried for an offence committed beyond India shall be dealt with according to the provisions of this Code for any act committed beyond India in the same manner as if such act had been committed within India.",
    "chapter": "INTRODUCTION",
    "chapter_number": 1,
    "keywords": [
      "committed",
      "india",
      "beyond",
      "tried",
      "within",
      "indian",
      "code",
      "punishment",
      "offences",
      "person"
    ],
    "category": "Criminal",
    "searchable_text": "3 punishment of offences committed beyond, but which by law may be tried within, india any person liable, by any indian law, to be tried for an offence committed beyond india shall be dealt with according to the provisions of this code for any act committed beyond india in the same manner as if such act had been committed within india. indian penal code ipc"
  },
  {
    "id": "IPC-4",
    "act_name": "Indian Penal Code",
    "act_year": 1860,
    "act_short_name": "IPC",
    "section_number": "4",
    "section_title": "Extension of Code to extra-territorial offences",
    "section_text": "The provisions of this Code apply also to any offence committed by any citizen of India in any place without and beyond India; any person on any ship or aircraft registered in India wherever it may be.",
    "chapter": "INTRODUCTION",
    "chapter_number": 1,
    "keywords": [
      "code",
      "india",
      "extension",
      "extra",
      "territorial",
      "offences",
      "provisions",
      "apply",
      "also",
      "offence"
    ],
    "category": "Criminal",
    "searchable_text": "4 extension of code to extra-territorial offences the provisions of this code apply also to any offence committed by any citizen of india in any place without and beyond india; any person on any ship or aircraft registered in india wherever it may be. indian penal code ipc"
  },
  {
    "id": "IPC-5",
    "act_name": "Indian Penal Code",
    "act_year": 1860,
    "act_short_name": "IPC",
    "section_number": "5",
    "section_title": "Certain laws not to be affected by this Act",
    "section_text": "Nothing in this Act shall affect the provisions of any Act for punishing mutiny and desertion of officers, soldiers, sailors or airmen in the service of the Government of India or the provisions of any special or local law.",
    "chapter": "INTRODUCTION",
    "chapter_number": 1,
    "keywords": [
      "provisions",
      "certain",
      "laws",
      "affected",
      "nothing",
      "affect",
      "punishing",
      "mutiny",
      "desertion",
      "officers"
    ],
    "category": "Criminal",
    "searchable_text": "5 certain laws not to be affected by this act nothing in this act shall affect the provisions of any act for punishing mutiny and desertion of officers, soldiers, sailors or airmen in the service of the government of india or the provisions of any special or local law. indian penal code ipc"
  },
  {
    "id": "IPC-6",
    "act_name": "Indian Penal Code",
    "act_year": 1860,
    "act_short_name": "IPC",
    "section_number": "6",
    "section_title": "Definitions in the Code to be understood subject to exceptions",
    "section_text": "Throughout this Code every definition of an offence, every penal provision, and every illustration of every such definition or penal provision, shall be understood subject to the exceptions contained in the Chapter entitled \"General Exceptions\", though those exceptions are not repeated in such definition, penal provision, or illustration.",
    "chapter": "GENERAL EXPLANATIONS",
    "chapter_number": 2,
    "keywords": [
      "exceptions",
      "every",
      "penal",
      "code",
      "definition",
      "provision",
      "understood",
      "subject",
      "illustration",
      "definitions"
    ],
    "category": "Criminal",
    "searchable_text": "6 definitions in the code to be understood subject to exceptions throughout this code every definition of an offence, every penal provision, and every illustration of every such definition or penal provision, shall be understood subject to the exceptions contained in the chapter entitled \"general exceptions\", though those exceptions are not repeated in such definition, penal provision, or illustration. indian penal code ipc"
  },
  {
    "id": "IPC-7",
    "act_name": "Indian Penal Code",
    "act_year": 1860,
    "act_short_name": "IPC",
    "section_number": "7",
    "section_title": "Sense of expression once explained",
    "section_text": "Every expression which is explained in any part of this Code, is used in every part of this Code in conformity with the explanation.",
    "chapter": "GENERAL EXPLANATIONS",
    "chapter_number": 2,
    "keywords": [
      "code",
      "expression",
      "explained",
      "every",
      "part",
      "sense",
      "once",
      "used",
      "conformity",
      "explanation"
    ],
    "category": "Criminal",
    "searchable_text": "7 sense of expression once explained every expression which is explained in any part of this code, is used in every part of this code in conformity with the explanation. indian penal code ipc"
  },
  {
    "id": "IPC-8",
    "act_name": "Indian Penal Code",
    "act_year": 1860,
    "act_short_name": "IPC",
    "section_number": "8",
    "section_title": "Gender",
    "section_text": "The pronoun \"he\" and its derivatives are used of any person, whether male or female.",
    "chapter": "GENERAL EXPLANATIONS",
    "chapter_number": 2,
    "keywords": [
      "gender",
      "pronoun",
      "derivatives",
      "used",
      "person",
      "whether",
      "male",
      "female",
      "indian",
      "penal"
    ],
    "category": "Criminal",
    "searchable_text": "8 gender the pronoun \"he\" and its derivatives are used of any person, whether male or female. indian penal code ipc"
  },
  {
    "id": "IPC-9",
    "act_name": "Indian Penal Code",
    "act_year": 1860,
    "act_short_name": "IPC",
    "section_number": "9",
    "section_title": "Number",
    "section_text": "Unless the contrary appears from the context, words importing the singular number include the plural number, and vice versa.",
    "chapter": "GENERAL EXPLANATIONS",
    "chapter_number": 2,
    "keywords": [
      "number",
      "unless",
      "contrary",
      "appears",
      "context",
      "words",
      "importing",
      "singular",
      "include",
      "plural"
    ],
    "category": "Criminal",
    "searchable_text": "9 number unless the contrary appears from the context, words importing the singular number include the plural number, and vice versa. indian penal code ipc"
  },
  {
    "id": "IPC-10",
    "act_name": "Indian Penal Code",
    "act_year": 1860,
    "act_short_name": "IPC",
    "section_number": "10",
    "section_title": "\"Man\" and \"Woman\"",
    "section_text": "The word \"man\" denotes a male human being of any age; the word \"woman\" denotes a female human being of any age.",
    "chapter": "GENERAL EXPLANATIONS",
    "chapter_number": 2,
    "keywords": [
      "woman",
      "word",
      "denotes",
      "human",
      "male",
      "female",
      "indian",
      "penal",
      "code"
    ],
    "category": "Criminal",
    "searchable_text": "10 \"man\" and \"woman\" the word \"man\" denotes a male human being of any age; the word \"woman\" denotes a female human being of any age. indian penal code ipc"
  },
  {
    "id": "IPC-378",
    "act_name": "Indian Penal Code",
    "act_year": 1860,
    "act_short_name": "IPC",
    "section_number": "378",
    "section_title": "Theft",
    "section_text": "Whoever, intending to take dishonestly any movable property out of the possession of any person without that person's consent, moves that property in order to such taking, is said to commit theft. Explanation 1: A thing so long as it is attached to the earth, not being movable property, is not the subject of theft; but it becomes capable of being the subject of theft as soon as it is severed from the earth.",
    "chapter": "OF OFFENCES AGAINST PROPERTY",
    "chapter_number": 3,
    "keywords": [
      "theft",
      "property",
      "movable",
      "person",
      "earth",
      "subject",
      "whoever",
      "intending",
      "take",
      "dishonestly"
    ],
    "category": "Theft & Robbery",
    "searchable_text": "378 theft whoever, intending to take dishonestly any movable property out of the possession of any person without that person's consent, moves that property in order to such taking, is said to commit theft. explanation 1: a thing so long as it is attached to the earth, not being movable property, is not the subject of theft; but it becomes capable of being the subject of theft as soon as it is severed from the earth. indian penal code ipc"
  },
  {
    "id": "IPC-379",
    "act_name": "Indian Penal Code",
    "act_year": 1860,
    "act_short_name": "IPC",
    "section_number": "379",
    "section_title": "Punishment for theft",
    "section_text": "Whoever commits theft shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both.",
    "chapter": "OF OFFENCES AGAINST PROPERTY",
    "chapter_number": 3,
    "punishment": "shall be punished with imprisonment of either description for a term which may extend to three years,",
    "keywords": [
      "theft",
      "punishment",
      "whoever",
      "commits",
      "punished",
      "imprisonment",
      "either",
      "description",
      "term",
      "extend"
    ],
    "category": "Theft & Robbery",
    "searchable_text": "379 punishment for theft whoever commits theft shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both. indian penal code ipc"
  },
  {
    "id": "IPC-380",
    "act_name": "Indian Penal Code",
    "act_year": 1860,
    "act_short_name": "IPC",
    "section_number": "380",
    "section_title": "Theft in dwelling house, etc.",
    "section_text": "Whoever commits theft in any building, tent or vessel, which building, tent or vessel is used as a human dwelling, or for the custody of property, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
    "chapter": "OF OFFENCES AGAINST PROPERTY",
    "chapter_number": 3,
    "punishment": "shall be punished with imprisonment of either description for a term which may extend to seven years,",
    "keywords": [
      "theft",
      "dwelling",
      "building",
      "tent",
      "vessel",
      "house",
      "whoever",
      "commits",
      "used",
      "human"
    ],
    "category": "Theft & Robbery",
    "searchable_text": "380 theft in dwelling house, etc. whoever commits theft in any building, tent or vessel, which building, tent or vessel is used as a human dwelling, or for the custody of property, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine. indian penal code ipc"
  },
  {
    "id": "IPC-390",
    "act_name": "Indian Penal Code",
    "act_year": 1860,
    "act_short_name": "IPC",
    "section_number": "390",
    "section_title": "Robbery",
    "section_text": "In all robbery there is either theft or extortion. When theft is robbery: Theft is \"robbery\" if, in order to the committing of the theft, or in committing the theft, or in carrying away or attempting to carry away property obtained by the theft, the offender, for that end, voluntarily causes or attempts to cause to any person death or hurt or wrongful restraint, or fear of instant death or of instant hurt, or of instant wrongful restraint.",
    "chapter": "OF OFFENCES AGAINST PROPERTY",
    "chapter_number": 3,
    "punishment": "death",
    "keywords": [
      "theft",
      "robbery",
      "instant",
      "committing",
      "away",
      "death",
      "hurt",
      "wrongful",
      "restraint",
      "there"
    ],
    "category": "Homicide",
    "searchable_text": "390 robbery in all robbery there is either theft or extortion. when theft is robbery: theft is \"robbery\" if, in order to the committing of the theft, or in committing the theft, or in carrying away or attempting to carry away property obtained by the theft, the offender, for that end, voluntarily causes or attempts to cause to any person death or hurt or wrongful restraint, or fear of instant death or of instant hurt, or of instant wrongful restraint. indian penal code ipc"
  },
  {
    "id": "IPC-392",
    "act_name": "Indian Penal Code",
    "act_year": 1860,
    "act_short_name": "IPC",
    "section_number": "392",
    "section_title": "Punishment for robbery",
    "section_text": "Whoever commits robbery shall be punished with rigorous imprisonment for a term which may extend to ten years, and shall also be liable to fine; and, if the robbery be committed on the highway between sunset and sunrise, the imprisonment may be extended to fourteen years.",
    "chapter": "OF OFFENCES AGAINST PROPERTY",
    "chapter_number": 3,
    "punishment": "shall be punished with rigorous imprisonment for a term which may extend to ten years,",
    "keywords": [
      "robbery",
      "imprisonment",
      "years",
      "punishment",
      "whoever",
      "commits",
      "punished",
      "rigorous",
      "term",
      "extend"
    ],
    "category": "Theft & Robbery",
    "searchable_text": "392 punishment for robbery whoever commits robbery shall be punished with rigorous imprisonment for a term which may extend to ten years, and shall also be liable to fine; and, if the robbery be committed on the highway between sunset and sunrise, the imprisonment may be extended to fourteen years. indian penal code ipc"
  },
  {
    "id": "IPC-393",
    "act_name": "Indian Penal Code",
    "act_year": 1860,
    "act_short_name": "IPC",
    "section_number": "393",
    "section_title": "Attempt to commit robbery",
    "section_text": "Whoever attempts to commit robbery shall be punished with rigorous imprisonment for a term which may extend to seven years, and shall also be liable to fine.",
    "chapter": "OF OFFENCES AGAINST PROPERTY",
    "chapter_number": 3,
    "punishment": "shall be punished with rigorous imprisonment for a term which may extend to seven years,",
    "keywords": [
      "commit",
      "robbery",
      "attempt",
      "whoever",
      "attempts",
      "punished",
      "rigorous",
      "imprisonment",
      "term",
      "extend"
    ],
    "category": "Theft & Robbery",
    "searchable_text": "393 attempt to commit robbery whoever attempts to commit robbery shall be punished with rigorous imprisonment for a term which may extend to seven years, and shall also be liable to fine. indian penal code ipc"
  },
  {
    "id": "IPC-395",
    "act_name": "Indian Penal Code",
    "act_year": 1860,
    "act_short_name": "IPC",
    "section_number": "395",
    "section_title": "Punishment for dacoity",
    "section_text": "Whoever commits dacoity shall be punished with imprisonment for life, or with rigorous imprisonment for a term which may extend to ten years, and shall also be liable to fine.",
    "chapter": "OF OFFENCES AGAINST PROPERTY",
    "chapter_number": 3,
    "punishment": "shall be punished with imprisonment for life,",
    "keywords": [
      "dacoity",
      "imprisonment",
      "punishment",
      "whoever",
      "commits",
      "punished",
      "life",
      "rigorous",
      "term",
      "extend"
    ],
    "category": "Theft & Robbery",
    "searchable_text": "395 punishment for dacoity whoever commits dacoity shall be punished with imprisonment for life, or with rigorous imprisonment for a term which may extend to ten years, and shall also be liable to fine. indian penal code ipc"
  },
  {
    "id": "IPC-299",
    "act_name": "Indian Penal Code",
    "act_year": 1860,
    "act_short_name": "IPC",
    "section_number": "299",
    "section_title": "Culpable homicide",
    "section_text": "Whoever causes death by doing an act with the intention of causing death, or with the intention of causing such bodily injury as is likely to cause death, or with the knowledge that he is likely by such act to cause death, commits the offence of culpable homicide.",
    "chapter": "OF OFFENCES AFFECTING THE HUMAN BODY",
    "chapter_number": 4,
    "punishment": "death",
    "keywords": [
      "death",
      "culpable",
      "homicide",
      "intention",
      "causing",
      "likely",
      "cause",
      "whoever",
      "causes",
      "doing"
    ],
    "category": "Homicide",
    "searchable_text": "299 culpable homicide whoever causes death by doing an act with the intention of causing death, or with the intention of causing such bodily injury as is likely to cause death, or with the knowledge that he is likely by such act to cause death, commits the offence of culpable homicide. indian penal code ipc"
  },
  {
    "id": "IPC-300",
    "act_name": "Indian Penal Code",
    "act_year": 1860,
    "act_short_name": "IPC",
    "section_number": "300",
    "section_title": "Murder",
    "section_text": "Except in the cases hereinafter excepted, culpable homicide is murder, if the act by which the death is caused is done with the intention of causing death.",
    "chapter": "OF OFFENCES AFFECTING THE HUMAN BODY",
    "chapter_number": 4,
    "punishment": "death",
    "keywords": [
      "murder",
      "death",
      "except",
      "cases",
      "hereinafter",
      "excepted",
      "culpable",
      "homicide",
      "caused",
      "done"
    ],
    "category": "Homicide",
    "searchable_text": "300 murder except in the cases hereinafter excepted, culpable homicide is murder, if the act by which the death is caused is done with the intention of causing death. indian penal code ipc"
  },
  {
    "id": "IPC-302",
    "act_name": "Indian Penal Code",
    "act_year": 1860,
    "act_short_name": "IPC",
    "section_number": "302",
    "section_title": "Punishment for murder",
    "section_text": "Whoever commits murder shall be punished with death, or imprisonment for life, and shall also be liable to fine.",
    "chapter": "OF OFFENCES AFFECTING THE HUMAN BODY",
    "chapter_number": 4,
    "punishment": "shall be punished with death,",
    "keywords": [
      "murder",
      "punishment",
      "whoever",
      "commits",
      "punished",
      "death",
      "imprisonment",
      "life",
      "also",
      "liable"
    ],
    "category": "Homicide",
    "searchable_text": "302 punishment for murder whoever commits murder shall be punished with death, or imprisonment for life, and shall also be liable to fine. indian penal code ipc"
  },
  {
    "id": "IPC-304",
    "act_name": "Indian Penal Code",
    "act_year": 1860,
    "act_short_name": "IPC",
    "section_number": "304",
    "section_title": "Punishment for culpable homicide not amounting to murder",
    "section_text": "Whoever commits culpable homicide not amounting to murder shall be punished with imprisonment for life, or imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine, if the act by which the death is caused is done with the intention of causing death, or of causing such bodily injury as is likely to cause death.",
    "chapter": "OF OFFENCES AFFECTING THE HUMAN BODY",
    "chapter_number": 4,
    "punishment": "shall be punished with imprisonment for life,",
    "keywords": [
      "death",
      "culpable",
      "homicide",
      "amounting",
      "murder",
      "imprisonment",
      "causing",
      "punishment",
      "whoever",
      "commits"
    ],
    "category": "Homicide",
    "searchable_text": "304 punishment for culpable homicide not amounting to murder whoever commits culpable homicide not amounting to murder shall be punished with imprisonment for life, or imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine, if the act by which the death is caused is done with the intention of causing death, or of causing such bodily injury as is likely to cause death. indian penal code ipc"
  },
  {
    "id": "IPC-307",
    "act_name": "Indian Penal Code",
    "act_year": 1860,
    "act_short_name": "IPC",
    "section_number": "307",
    "section_title": "Attempt to murder",
    "section_text": "Whoever does any act with such intention or knowledge, and under such circumstances that, if he by that act caused death, he would be guilty of murder, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine; and if hurt is caused to any person by such act, the offender shall be liable either to imprisonment for life, or to such punishment as is hereinbefore mentioned.",
    "chapter": "OF OFFENCES AFFECTING THE HUMAN BODY",
    "chapter_number": 4,
    "punishment": "shall be punished with imprisonment of either description for a term which may extend to ten years,",
    "keywords": [
      "murder",
      "caused",
      "imprisonment",
      "either",
      "liable",
      "attempt",
      "whoever",
      "does",
      "intention",
      "knowledge"
    ],
    "category": "Homicide",
    "searchable_text": "307 attempt to murder whoever does any act with such intention or knowledge, and under such circumstances that, if he by that act caused death, he would be guilty of murder, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine; and if hurt is caused to any person by such act, the offender shall be liable either to imprisonment for life, or to such punishment as is hereinbefore mentioned. indian penal code ipc"
  }
]